# 3. Четырехзначное?
# Пользователь вводит целое число. Выведите YES,
# если это число является четырехзначным, и NO в противном случае.

number = input('Введите целое число :')
if len(number) == 4:
    print('Yes')
else:
    print('No')
